#include <iostream>;
#include <cmath>;
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");
	//Даны два числа.Вывести порядковый номер меньшего из них
	/*int a, b;
	cin >> a >> b;
	if (a < b) {
		cout << "1" << endl;
	}
	else if (b < a) {
		cout << "2" << endl;
	}
	else if (a == b) {
		cout << " " << endl;
	}*/
	//If8◦.Даны два числа.Вывести вначале большее, а затем меньшее из них.
	/*int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a << endl;
		cout << a << endl;
	}
	else if (b > a) {
		cout << b << endl;
		cout << a << endl;
	}
	else if (a == b) {
		cout << a << b << endl;*/
		//If10.Даны две переменные вещественного типа : A, B.Перераспределить значения данных переменных так, чтобы в A оказалось меньшее из значений,а в B — большее.Вывести новые значения переменных A и B.
		/*int a,b;
		cin >> a >> b;
		if (a != b ) {
			int sum = a+b;
			a=sum;
			b = sum;
		}
		else {
			a=b=0;
		}
			cout << a << " "<< b << endl;*/
	//If12◦.Даны три числа.Найти наименьшее из них.
	/*int a, b, c;
	cin >> a >> b >> c;
	if (a < b && a < c) {
		cout << a << endl;
	}
	if (b < a && b < c) {
		cout << b << endl;
	}
	if (c < a && c < b) {
		cout << c << endl;*/
//If24.Для данного вещественного x найти значение следующей функции f,	принимающей вещественные значения :f(x) = 2·sin(x), если x > 0,	6 − x, если x ≤ 0.
	/*double x, b;
	cin >> x;
	if (x > 0) {
		b = 2 * sin(x);
		cout << b << endl;
	}
	else (x <= 0) {
		b = 6 - x;
		cout << b << endl;
	}*/
	//If25.Для данного целого x найти значение следующей функции f, принимающей значения целого типа :f(x) = 2·x, если x < −2 или x > 2,−3·x, в противном случае.
	/*int x, b;
	cin >> x;
	if (x < -2 || x>2) {
		b = 2*x;
		cout << b << endl;
	}
	else (x <= 0) {
		b = -3 * x;
		cout << b << endl;
	}*/
	//If26◦	.Для данного вещественного x найти значение следующей функции f,	принимающей вещественные значения :−x, если x ≤ 0,	f(x) = x	2, если 0 < x < 2,4, если x ≥ 2.
	/*int x, b;
	cin >> x;
	if (x <= 0) {
		b = -x;
		cout << b << endl;
	}
	else if (0 < x < 2) {
		b = x * x;
		cout << b << endl;
	}
	else if (x >= 2) {

		b = 4;
		cout << b << endl;*/
	//}
	//If29.Дано целое число.Вывести его строку - описание вида «отрицательноечетное число», «нулевое число», «положительное нечетное число» и т.д.


	
		


		
	
}